Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 128, 128, 4) 0                                            
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 128, 128, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
model (Model)                   [(None, 64, 64, 96), 616256      lambda[0][0]                     
__________________________________________________________________________________________________
upsample_0 (Sequential)         (None, 16, 16, 8)    84128       model[1][3]                      
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 16, 16, 200)  0           model[1][2]                      
                                                                 upsample_0[0][0]                 
__________________________________________________________________________________________________
upsample_1 (Sequential)         (None, 32, 32, 8)    29984       concatenate[0][0]                
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 152)  0           model[1][1]                      
                                                                 upsample_1[0][0]                 
__________________________________________________________________________________________________
upsample_2 (Sequential)         (None, 64, 64, 8)    23072       concatenate_1[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64, 64, 104)  0           model[1][0]                      
                                                                 upsample_2[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 128, 128, 2)  1874        concatenate_2[0][0]              
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 128, 128, 1)  0           input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 128, 128, 3)  0           conv2d_transpose[0][0]           
                                                                 lambda_1[0][0]                   
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 128, 128, 2)  8           concatenate_3[0][0]              
__________________________________________________________________________________________________
softmax (Softmax)               (None, 128, 128, 2)  0           conv2d[0][0]                     
==================================================================================================
Total params: 755,322
Trainable params: 139,018
Non-trainable params: 616,304
__________________________________________________________________________________________________
