Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
model (Model)                   [(None, 64, 64, 96), 1841984     input_2[0][0]                    
__________________________________________________________________________________________________
sequential (Sequential)         (None, 8, 8, 512)    1476608     model[1][4]                      
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 8, 8, 1088)   0           sequential[0][0]                 
                                                                 model[1][3]                      
__________________________________________________________________________________________________
sequential_1 (Sequential)       (None, 16, 16, 256)  2507776     concatenate[0][0]                
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 16, 16, 448)  0           sequential_1[0][0]               
                                                                 model[1][2]                      
__________________________________________________________________________________________________
sequential_2 (Sequential)       (None, 32, 32, 128)  516608      concatenate_1[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 32, 32, 272)  0           sequential_2[0][0]               
                                                                 model[1][1]                      
__________________________________________________________________________________________________
sequential_3 (Sequential)       (None, 64, 64, 64)   156928      concatenate_2[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 64, 64, 160)  0           sequential_3[0][0]               
                                                                 model[1][0]                      
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 128, 128, 2)  2882        concatenate_3[0][0]              
==================================================================================================
Total params: 6,502,786
Trainable params: 4,658,882
Non-trainable params: 1,843,904
__________________________________________________________________________________________________
